; domain
;Header and description

(define (domain normalDelivery_battery)


;remove requirements that are not needed
;(:requirements :strips :fluents :durative-actions :timed-initial-literals :typing :conditional-effects :negative-preconditions :duration-inequalities :equality ::disjunctive-preconditions)
(:requirements :typing :equality :negative-preconditions :disjunctive-preconditions)

(:types 
    robot - object
    location - object
    carrier - object
    crate - object
    person - object
    loc base charge - location
    food meds - crate
    crate_amount bat_amount - counter
    counter - object
)

; un-comment following line if constants are needed
(:constants
    operator - robot
    depot - base
    n0 - crate_amount
    ;bat_car0 bat_rob0 - bat_amount
    bat_car0 bat_rob0 - bat_amount
    charging_station - charge
)

(:predicates 
    ;crates
    (crate_at ?c - crate ?l - location)     ;crate ?c crate_at at location ?l
    ;(is_loaded ?c - crate)           ;crate unavailable because loaded 
    (is_delivered ?c - crate)                       ;crate unavailable because delivered

    ;robot
    (robot_at ?r - robot ?l - location)     ;robot ?r is at location ?l
    (is_empty ?r - robot)           ;robot ?r is empty
    
    ;people
    (person_at ?p - person ?l - location)       ;person ?p is at location ?l
    (served ?p - person ?c - crate)              ;person ?p has been served with crate ?c
    ;(needs ?p - person ?cont - content)            ;added as a result of OPTIC non-compatibility
    ;(not_needs ?p - person ?cont - content)

    ;carrier
    (carrier_at ?k - carrier ?l - location)
    (bearing ?k - carrier ?c - crate)         ;carrier ?k is bearing crate ?c

    ;predicates to avoid using fluents
    (add ?init_amount ?final_amount - crate_amount)
    (pop ?orig_amount ?final_amount - crate_amount)
    ;differentiate crate_count per carrier (in case there is more than one)
    (crate_count ?k - carrier ?num_crates - crate_amount)

    ;add forklift and carrier with battery
    (charge_battery_carrier ?init_car ?final_car - bat_amount ?k - carrier)
    (charge_battery_robot ?init_rob ?final_rob - bat_amount ?r - robot)

    (dec_battery_carrier ?origin_car ?final_car - bat_amount ?k - carrier)
    (dec_battery_robot ?origin_rob ?final_rob - bat_amount ?r - robot)

    (battery_level_carrier ?k - carrier ?battery_car - bat_amount)
    (battery_level_robot ?r - robot ?battery_rob - bat_amount) 


)


;moves robot between two locations: ?from and ?to
;NOTE: crates of no kind are involved
(:action move
    :parameters (?r - robot ?k - carrier ?from - location ?to - location ?origin_car ?final_car ?origin_rob ?final_rob - bat_amount)
    :precondition (and 
        (robot_at ?r ?from)
        (carrier_at ?k ?from)
        (not(=?from ?to))           ;this way carrier is forced to pick action back_to_base to reload 
        (not(battery_level_carrier ?k bat_car0))            ;checking battey is NOT 0%
        (not(battery_level_robot ?r bat_rob0))              ;checking battey is NOT 0%
        
        (dec_battery_carrier ?origin_car ?final_car ?k)
        (battery_level_carrier ?k ?origin_car)
        (dec_battery_robot ?origin_rob ?final_rob ?r)
        (battery_level_robot ?r ?origin_rob)
    )
    :effect(and
        (not(robot_at ?r ?from))
        (robot_at ?r ?to)
        (not(carrier_at ?k ?from))
        (carrier_at ?k ?to) 
          
        (not(battery_level_carrier ?k ?origin_car))
        (battery_level_carrier ?k ?final_car) 
        (not(battery_level_robot ?r ?origin_rob))
        (battery_level_robot ?r ?final_rob)   
    )
)
;send robot ?r and carrier ?k back to base (depot)
(:action back_to_base
    :parameters (?from - loc ?to - base ?r - robot ?k - carrier)
    :precondition (and 
        (robot_at ?r ?from)
        (carrier_at ?k ?from)
        (crate_count ?k n0)            ;carrier cannot take cut-off unless empty
        
    )
    :effect(and
        (not (robot_at ?r ?from))
        (not (carrier_at ?k ?from))
        (robot_at ?r ?to)
        (carrier_at ?k ?to)

    )   
)

(:action back_to_charging_station
    :parameters (?r - robot ?k - carrier ?from - location) ;?origin_car ?final_car ?origin_rob ?final_rob - amount)
    :precondition (and 
        (or (battery_level_carrier ?k bat_car0)(battery_level_robot ?r bat_rob0))
        ;(battery_level_carrier ?k bat_car0)
        ;(battery_level_robot ?r bat_rob0)
        (robot_at ?r ?from)
        (carrier_at ?k ?from)
        ;DONT TOUCH
        ;(dec_battery_carrier ?origin_car ?final_car ?k)
        ;(dec_battery_robot ?origin_rob ?final_rob ?r)
    )

    :effect (and
        (not(robot_at ?r ?from))
        (not(carrier_at ?k ?from))
        (robot_at ?r charging_station)
        (carrier_at ?k charging_station)
        ;DONT TOUCH
        ;(not(battery_level_carrier ?k ?origin_car))
        ;(not(battery_level_robot ?r ?origin_rob))
        ;(battery_level_carrier ?k ?final_car)
        ;(battery_level_robot ?r ?final_rob) 
    )
)

;load (generic) crate ?c onto robot ?r at location ?l
(:action load_crate
    :parameters (?depot - base ?c - crate ?r - robot ?k - carrier ?init_amount ?final_amount - crate_amount ?origin_rob ?final_rob - bat_amount)
    :precondition (and
        (robot_at ?r ?depot)
        (carrier_at ?k ?depot)
        (crate_at ?c ?depot)
        (not (bearing ?k ?c))
        (not (is_delivered ?c))
        (not (battery_level_carrier ?k bat_car0))       ;checking battey is NOT 0%
        (not (battery_level_robot ?r bat_rob0))         ;checking battey is NOT 0%
        
        ;tracking crate count
        (add ?init_amount ?final_amount)                ;updating initial and final heaps, essential for counting crates
        (crate_count ?k ?init_amount)                   ;this prevents multiple robots to load multiple crates at a time
        
        ;tracking battery life
        (dec_battery_robot ?origin_rob ?final_rob ?r)   ;updates battery discharge for load task
        (battery_level_robot ?r ?origin_rob)

    )
    :effect (and
        (bearing ?k ?c)
        (not (crate_at ?c ?depot))
        (is_empty ?r)
        
        (not (crate_count ?k ?init_amount))
        (crate_count ?k ?final_amount)
        
        (not (battery_level_robot ?r ?origin_rob))
        (battery_level_robot ?r ?final_rob)
             
    )
)

;;deliver (generic) crate ?c to location ?l to person ?p
(:action deliver_crate
    :parameters (?r - robot ?c - crate ?to - loc ?p - person ?k - carrier ?init_amount ?final_amount - crate_amount ?origin_rob ?final_rob - bat_amount)
    :precondition (and 
        (robot_at ?r ?to)
        (carrier_at ?k ?to)
        (person_at ?p ?to)
        (not (is_delivered ?c))
        (bearing ?k ?c)
        (pop ?init_amount ?final_amount)
        (crate_count ?k ?init_amount)                   ;this prevents multiple robots to deliver multiple crates at a time
        
        (not (battery_level_robot ?r bat_rob0))         ;checking battery is NOT 0%
        (dec_battery_robot ?origin_rob ?final_rob ?r)   ;updates battery discharge for delivery task
        (battery_level_robot ?r ?origin_rob)
    )
    :effect (and
       (is_delivered ?c)
       (served ?p ?c)
       (not(bearing ?k ?c))
       (crate_at ?c ?to)
       (not (crate_count ?k ?init_amount))
       (crate_count ?k ?final_amount)

       (not (battery_level_robot ?r ?origin_rob))
       (battery_level_robot ?r ?final_rob)

    )
)
(:action charge_battery
    :parameters (?charge - charge ?r - robot ?k - carrier ?init_car ?final_car ?init_rob ?final_rob - bat_amount)
    :precondition (and 
        (carrier_at ?k ?charge)
        (robot_at ?r ?charge)
        
        (charge_battery_carrier ?init_car ?final_car ?k)
        (battery_level_carrier ?k ?init_car)
        
        (charge_battery_robot ?init_rob ?final_rob ?r)
        (battery_level_robot ?r ?init_rob)
    )
    :effect (and 
        (carrier_at ?k ?charge)
        (robot_at ?r ?charge)
        (not(battery_level_carrier ?k ?init_car))
        (battery_level_carrier ?k ?final_car)
        (not(battery_level_robot ?r ?init_rob))
        (battery_level_robot ?r ?final_rob)
    )   
)


)

; problem
(define (problem problem2_battery) (:domain normalDelivery_battery)

(:objects
    l1 l2 l3 l4 l5 l6 l7 - loc
    matteo alice francesco eliana giorgio - person
    f1 f2 f3 f4 - food
    m1 m2 m3 - meds
    carrier - carrier

    ;adding amount objects
    n1 n2 n3 n4 - crate_amount
    bat_car1 bat_car2 bat_car3 bat_car4 bat_car5 bat_car6 bat_car7 bat_car8 bat_car9 bat_car10 - bat_amount
    bat_rob1 bat_rob2 bat_rob3 bat_rob4 bat_rob5 bat_rob6 bat_rob7 bat_rob8 bat_rob9 bat_rob10 - bat_amount
)

(:init
    ;crates location
    (crate_at f1 depot)
    (crate_at f2 depot)
    (crate_at f3 depot)
    (crate_at f4 depot)
    (crate_at m1 depot)
    (crate_at m2 depot)
    (crate_at m3 depot)

    ;delivery state
    (not (is_delivered f1))
    (not (is_delivered f2))
    (not (is_delivered f3))
    (not (is_delivered f4))
    (not (is_delivered m1))
    (not (is_delivered m2))
    (not (is_delivered m3))


    ;robot location
    (robot_at operator depot)
    (is_empty operator)

    ;carrier location
    (carrier_at carrier depot)
    ;initialize carrier crate_count
    (crate_count carrier n0)            ;resets the counter

    ;people location
    (person_at matteo l1)
    (person_at eliana l2)
    (person_at francesco l2)
    (person_at alice l7)
    (person_at giorgio l3)
    

    ;add-pop relationships: \ref{elevator problem}
    (add n0 n1)
    (add n1 n2)
    (add n2 n3)
    (add n3 n4)

    (pop n4 n3)
    (pop n3 n2)
    (pop n2 n1)
    (pop n1 n0)

    ;add initial battery 
    ;(battery_level_carrier carrier bat_car10)
    ;(battery_level_robot operator bat_rob10)

    ;charge_battery and dec_battery
    ;(charge_battery_carrier bat_car0 bat_car10 carrier)
    ;(charge_battery_robot bat_rob0 bat_rob10 operator)

    (dec_battery_carrier bat_car10 bat_car8 carrier)
    (dec_battery_carrier bat_car8 bat_car6 carrier)
    (dec_battery_carrier bat_car6 bat_car4 carrier)
    (dec_battery_carrier bat_car4 bat_car2 carrier)
    (dec_battery_carrier bat_car2 bat_car0 carrier)
    
    (dec_battery_robot bat_rob10 bat_rob9 operator)
    (dec_battery_robot bat_rob9 bat_rob8 operator)
    (dec_battery_robot bat_rob8 bat_rob7 operator)
    (dec_battery_robot bat_rob7 bat_rob6 operator)
    (dec_battery_robot bat_rob6 bat_rob5 operator)
    (dec_battery_robot bat_rob5 bat_rob4 operator)
    (dec_battery_robot bat_rob4 bat_rob3 operator)
    (dec_battery_robot bat_rob3 bat_rob2 operator)
    (dec_battery_robot bat_rob2 bat_rob1 operator)
    (dec_battery_robot bat_rob1 bat_rob0 operator)

    ;TEST-ONLY
    (battery_level_carrier carrier bat_car6)
    (battery_level_robot operator bat_rob6)

    (charge_battery_carrier bat_car0 bat_car6 carrier)
    (charge_battery_robot bat_rob0 bat_rob6 operator)

    ;(dec_battery_robot bat_rob6 bat_rob4 operator)
    ;(dec_battery_robot bat_rob4 bat_rob2 operator)
    ;(dec_battery_robot bat_rob2 bat_rob0 operator)
    ;(dec_battery_carrier bat_car6 bat_car4 carrier)
    ;(dec_battery_carrier bat_car4 bat_car2 carrier)
    ;(dec_battery_carrier bat_car2 bat_car0 carrier)
    
    
)

(:goal (and
    
    ;Eliana needs food
    (or (served eliana f1)(served eliana f2)(served eliana f3)(served eliana f4))
    ;(exists (?c - food) (and (served eliana ?c)))


    
    ;Matteo needs 2 crates of meds
    (or (served matteo f1)(served matteo f2)(served matteo f3)(served matteo f4))
    (or (served matteo m1)(served matteo m2)(served matteo m3))
    ;(exists (?c - meds) (and (served matteo ?c)))
    

    ;Francesco needs both food and meds
    (or (served francesco m1)(served francesco m2)(served francesco m3))
    (or (served francesco m1)(served francesco m2)(served francesco m3))
    ;(exists (?c - meds) (and (served francesco ?c)))
    ;(exists (?c - food) (and (served francesco ?c)))

    ;Alice needs meds
    (or (served alice f1)(served alice f2)(served alice f3)(served alice f4))
    ;(exists (?c - meds) (and (served alice ?c)))
))

)

; plan
1. (load_crate depot f3 operator carrier n0 n1 bat_rob6 bat_rob5)
   deleted: (crate_at f3 depot) (crate_count carrier n0) (battery_level_robot operator bat_rob6)
   added: (bearing carrier f3) (crate_count carrier n1) (battery_level_robot operator bat_rob5)
   goals met: 0 of 6
2. (load_crate depot m1 operator carrier n1 n2 bat_rob5 bat_rob4)
   deleted: (crate_at m1 depot) (crate_count carrier n1) (battery_level_robot operator bat_rob5)
   added: (bearing carrier m1) (crate_count carrier n2) (battery_level_robot operator bat_rob4)
   goals met: 0 of 6
3. (move operator carrier depot l1 bat_car6 bat_car4 bat_rob4 bat_rob3)
   deleted: (robot_at operator depot) (carrier_at carrier depot) (battery_level_carrier carrier bat_car6) (battery_level_robot operator bat_rob4)
   added: (robot_at operator l1) (carrier_at carrier l1) (battery_level_carrier carrier bat_car4) (battery_level_robot operator bat_rob3)
   goals met: 0 of 6
4. (move operator carrier l1 l7 bat_car4 bat_car2 bat_rob3 bat_rob2)
   deleted: (robot_at operator l1) (carrier_at carrier l1) (battery_level_carrier carrier bat_car4) (battery_level_robot operator bat_rob3)
   added: (robot_at operator l7) (carrier_at carrier l7) (battery_level_carrier carrier bat_car2) (battery_level_robot operator bat_rob2)
   goals met: 0 of 6
5. (deliver_crate operator f3 l7 alice carrier n2 n1 bat_rob2 bat_rob1)
   deleted: (bearing carrier f3) (crate_count carrier n2) (battery_level_robot operator bat_rob2)
   added: (is_delivered f3) (served alice f3) (crate_at f3 l7) (crate_count carrier n1) (battery_level_robot operator bat_rob1)
   goals met: 1 of 6
6. (move operator carrier l7 charging_station bat_car2 bat_car0 bat_rob1 bat_rob0)
   deleted: (robot_at operator l7) (carrier_at carrier l7) (battery_level_carrier carrier bat_car2) (battery_level_robot operator bat_rob1)
   added: (robot_at operator charging_station) (carrier_at carrier charging_station) (battery_level_carrier carrier bat_car0) (battery_level_robot operator bat_rob0)
   goals met: 1 of 6
7. (charge_battery charging_station operator carrier bat_car0 bat_car6 bat_rob0 bat_rob6)
   deleted: (battery_level_carrier carrier bat_car0) (battery_level_robot operator bat_rob0)
   added: (battery_level_carrier carrier bat_car6) (battery_level_robot operator bat_rob6)
   goals met: 1 of 6
8. (move operator carrier charging_station depot bat_car6 bat_car4 bat_rob6 bat_rob5)
   deleted: (robot_at operator charging_station) (carrier_at carrier charging_station) (battery_level_carrier carrier bat_car6) (battery_level_robot operator bat_rob6)
   added: (robot_at operator depot) (carrier_at carrier depot) (battery_level_carrier carrier bat_car4) (battery_level_robot operator bat_rob5)
   goals met: 1 of 6
9. (load_crate depot f1 operator carrier n1 n2 bat_rob5 bat_rob4)
   deleted: (crate_at f1 depot) (crate_count carrier n1) (battery_level_robot operator bat_rob5)
   added: (bearing carrier f1) (crate_count carrier n2) (battery_level_robot operator bat_rob4)
   goals met: 1 of 6
10. (load_crate depot f2 operator carrier n2 n3 bat_rob4 bat_rob3)
   deleted: (crate_at f2 depot) (crate_count carrier n2) (battery_level_robot operator bat_rob4)
   added: (bearing carrier f2) (crate_count carrier n3) (battery_level_robot operator bat_rob3)
   goals met: 1 of 6
11. (load_crate depot m2 operator carrier n3 n4 bat_rob3 bat_rob2)
   deleted: (crate_at m2 depot) (crate_count carrier n3) (battery_level_robot operator bat_rob3)
   added: (bearing carrier m2) (crate_count carrier n4) (battery_level_robot operator bat_rob2)
   goals met: 1 of 6
12. (move operator carrier depot l1 bat_car4 bat_car2 bat_rob2 bat_rob1)
   deleted: (robot_at operator depot) (carrier_at carrier depot) (battery_level_carrier carrier bat_car4) (battery_level_robot operator bat_rob2)
   added: (robot_at operator l1) (carrier_at carrier l1) (battery_level_carrier carrier bat_car2) (battery_level_robot operator bat_rob1)
   goals met: 1 of 6
13. (move operator carrier l1 charging_station bat_car2 bat_car0 bat_rob1 bat_rob0)
   deleted: (robot_at operator l1) (carrier_at carrier l1) (battery_level_carrier carrier bat_car2) (battery_level_robot operator bat_rob1)
   added: (robot_at operator charging_station) (carrier_at carrier charging_station) (battery_level_carrier carrier bat_car0) (battery_level_robot operator bat_rob0)
   goals met: 1 of 6
14. (charge_battery charging_station operator carrier bat_car0 bat_car6 bat_rob0 bat_rob6)
   deleted: (battery_level_carrier carrier bat_car0) (battery_level_robot operator bat_rob0)
   added: (battery_level_carrier carrier bat_car6) (battery_level_robot operator bat_rob6)
   goals met: 1 of 6
15. (move operator carrier charging_station l1 bat_car6 bat_car4 bat_rob6 bat_rob5)
   deleted: (robot_at operator charging_station) (carrier_at carrier charging_station) (battery_level_carrier carrier bat_car6) (battery_level_robot operator bat_rob6)
   added: (robot_at operator l1) (carrier_at carrier l1) (battery_level_carrier carrier bat_car4) (battery_level_robot operator bat_rob5)
   goals met: 1 of 6
16. (deliver_crate operator m1 l1 matteo carrier n4 n3 bat_rob5 bat_rob4)
   deleted: (bearing carrier m1) (crate_count carrier n4) (battery_level_robot operator bat_rob5)
   added: (is_delivered m1) (served matteo m1) (crate_at m1 l1) (crate_count carrier n3) (battery_level_robot operator bat_rob4)
   goals met: 2 of 6
17. (deliver_crate operator f1 l1 matteo carrier n3 n2 bat_rob4 bat_rob3)
   deleted: (bearing carrier f1) (crate_count carrier n3) (battery_level_robot operator bat_rob4)
   added: (is_delivered f1) (served matteo f1) (crate_at f1 l1) (crate_count carrier n2) (battery_level_robot operator bat_rob3)
   goals met: 3 of 6
18. (move operator carrier l1 l2 bat_car4 bat_car2 bat_rob3 bat_rob2)
   deleted: (robot_at operator l1) (carrier_at carrier l1) (battery_level_carrier carrier bat_car4) (battery_level_robot operator bat_rob3)
   added: (robot_at operator l2) (carrier_at carrier l2) (battery_level_carrier carrier bat_car2) (battery_level_robot operator bat_rob2)
   goals met: 3 of 6
19. (deliver_crate operator f2 l2 eliana carrier n2 n1 bat_rob2 bat_rob1)
   deleted: (bearing carrier f2) (crate_count carrier n2) (battery_level_robot operator bat_rob2)
   added: (is_delivered f2) (served eliana f2) (crate_at f2 l2) (crate_count carrier n1) (battery_level_robot operator bat_rob1)
   goals met: 4 of 6
20. (deliver_crate operator m2 l2 francesco carrier n1 n0 bat_rob1 bat_rob0)
   deleted: (bearing carrier m2) (crate_count carrier n1) (battery_level_robot operator bat_rob1)
   added: (is_delivered m2) (served francesco m2) (crate_at m2 l2) (crate_count carrier n0) (battery_level_robot operator bat_rob0)
   goals met: 6 of 6
